[
  {
    "title": "Proof of Heaven: A Neurosurgeon's Near-Death Experience and Journey into the Afterlife",
    "asin": "1442359315",
    "description": "A neurosurgeon&#x2019;s first-person account of his near-death experience after an E. coli meningitis-related seizure and seven-day coma will reassure afterlife believers, though it is unlikely to convince skeptics. Alexander&#x2019;s credentials are impressive: medical school at Duke and 15 years at Harvard-affiliated hospitals. But to agnostics and atheists, Alexander may not come across as a completely objective observer. He writes that he attended his Episcopal church even as he questioned how God, heaven, and an afterlife could exist, yet the heaven he describes seeing certainly seems like a biblical one; a typical line is, &#x201C;the visual beauty of the silvery bodies of those scintillating beings above.&#x201D; His story includes interesting asides about past struggles with alcohol and with adoption. (His birth mother delivered him when she was 16 and for years did not want to meet him.) But the book mostly focuses on religion. It ends with a request to support Eternea, Alexander&#x2019;s nonprofit that has as its mission, &#x201C;increasing global acceptance of the reality of our eternal spiritual existence . . . under an all-loving God.&#x201D; For believers, not skeptics. --Karen Springen--This text refers to theHardcoveredition.",
    "imUrl": "http://ecx.images-amazon.com/images/I/613mqfDF5LL.jpg",
    "price": "7.99",
    "brand": null
  },
  {
    "title": "Home to Stay (An Anchor Island Novel)",
    "asin": "1477818367",
    "description": "&#x201C;If you&#x2019;re looking for a sweet contemporary with a little bit of intrigue...look no further. This...will leave readers longing for an oceanfront bar to hang out in.&#x201D; &#x2014;RT Book Reviews, 4 stars&#x201C;Another cute, romantic trip toAnchor Island...a hugely enjoyable read.&#x201D; &#x2014;Fresh Fiction&#x201C;I don&#x2019;t think that there is a more appealing hero than the Teddy Bear type, especially if they are &#x2018;large enough to deserve his own zip code&#x2019; like Randy Navarro. Terri Osburn definitely got my attention when she wrote him into the story!&#x201D; &#x2014;Leigh Davis, Heroes and Heartbreakers.com First Look",
    "imUrl": "http://ecx.images-amazon.com/images/I/51hyVZYz33L.jpg",
    "price": "4.99",
    "brand": null
  },
  {
    "title": "Chasing Amanda",
    "asin": "0615477526",
    "description": "&quot;...a story of madness and mystery that drew me in from the first paragraph...a tale of love, retribution, hope and betrayal...a page turner that will leave you breathless...&quot; --Readers Round Table&quot;...the MUST READ THRILLER of 2011. Intelligent, entrancing, luminious.&quot; --Author Dean Mayes",
    "imUrl": "http://ecx.images-amazon.com/images/I/81i6A5l8YuL.jpg",
    "price": "3.99",
    "brand": null
  },
  {
    "title": "Shooter: The Autobiography of the Top-Ranked Marine Sniper",
    "asin": "0312336853",
    "description": "",
    "imUrl": "http://ecx.images-amazon.com/images/I/41mfG6c%2BKdL.jpg",
    "price": "6.99",
    "brand": null
  },
  {
    "title": "A Wounded Name",
    "asin": "1467708879",
    "description": "Gr 9 Up&#x2013;This dark novel combines paranormal creatures and the legend of the drowned City of Ys with the events and characters from Shakespeare's Hamlet.&#xA0;It is told from the point of view of Ophelia Castellan, the teenaged daughter of an Elsinore Academy official who must take pills to prevent her visions of supernatural beings. Ophelia's mother drowned herself years before and is now a morgen, a sirenlike being, who tries to convince Ophelia to come to the drowned city in the lake. Ophelia also sees ghosts, including two different versions of the dead headmaster, Hamlet Danemark. As she struggles to come to terms with her visions, she becomes embroiled in an increasingly abusive and troubled relationship with Dane, the grieving son of the deceased headmaster. The troubled boy sees the angry ghost of his father and swears revenge on his Uncle Claudius. When Dane kills her father, Ophelia finds herself descending into madness; she has to decide whether or not to succumb to her mother's importuning. This novel is a very feminist take on the events of the play as it focuses on Ophelia and incorporates recent critical thinking about the tragic consequences of the limitations and restrictions placed on women. At times, the attempts to paraphrase Shakespeare's poetry seem awkward, particularly when juxtaposed with the author's own haunting and evocative prose. Still, readers familiar with Hamlet will be fascinated with this retelling.&#x2013;Kathleen E. Gruver, Burlington County Library, Westampton, NJ&#x3B1;(c) Copyright 2013.  Library Journals LLC, a wholly owned subsidiary of Media Source, Inc.  No redistribution permitted.",
    "imUrl": "http://ecx.images-amazon.com/images/I/41lb%2BijHGOL.jpg",
    "price": "9.39",
    "brand": null
  },
  {
    "title": "Pretty Little Secrets, Book 1",
    "asin": "0062125915",
    "description": "Praise for Pretty Little Liars: &#8220;Shepard does a fine job of writing an intriguing tale full of provocative exploits and adventure&#8230;It will not disappoint the fans.&#8221; (Voice of Youth Advocates (VOYA))&#8220;Shepard writes a suspenseful page&#150;turner that will have teens thirsting for more.&#8221; (School Library Journal)&#8220;Expect this teenage soap opera to fly off the shelves.&#8221; (Voice of Youth Advocates (VOYA))",
    "imUrl": "http://ecx.images-amazon.com/images/I/51fVdIEebPL.jpg",
    "price": "8.54",
    "brand": null
  },
  {
    "title": "I, Elizabeth",
    "asin": "0330309773",
    "description": "Popular historian ( The Women's History of the World ) and novelist ( Return to Eden ) Miles brings deep research to this iconoclastic but only partially successful fictional life of England's \"virgin queen,\" Elizabeth I. Miles traces, through the queen's own voice, Elizabeth's turbulent years as a princess in Henry VIII's court, her uneasy status during the brief reigns of her brother Edward and sister Mary and her decades on the throne. The author leaves no event unreported, describing in detail the defeat of the Spanish Armada, Elizabeth's struggles with Mary, Queen of Scots, and the rise and fall of Essex. In a genre that often uses passionate love scenes to temper the drier affairs of history, a novel about the world's second most famous female virgin presents a challenge. There are love scenes aplenty, however, since Miles depicts the young Elizabeth as being as sexually obsessed as she is frustrated, her interest in men overshadowing affairs of state, religion and the succession to the throne. Miles is at her best in describing everyday Elizabethan life--religion, food, dress, illness. But her Elizabeth lacks the charisma to carry this lengthy chronicle, which is weakened by the device of having the queen, in italicized passages, comment from a pallid, distant hindsight on her past actions. As an entertaining look at Reformation England, this novel succeeds, but it fails at the more immediate task of creating memorable fictional characters from the leavings of history. Literary Guild and Double day Book Club selections; author tour.Copyright 1994 Reed Business Information, Inc.--This text refers to an out of print or unavailable edition of this title.",
    "imUrl": "http://ecx.images-amazon.com/images/I/418N1FENFQL.jpg",
    "price": "10.99",
    "brand": null
  },
  {
    "title": "A Disobedient Girl: A Novel",
    "asin": "1439101957",
    "description": "Ru Freeman's debut novel chronicles the trials and travails of two Sri Lankan women and their pursuit of freedom. Orphaned then absorbed as a servant into a well-to-do Sri Lankan family at the age of five, Latha Kumari grows up in tandem with the family's spoiled young daughter, Thara. However, Latha's mysterious origins and ambiguous caste ensure her a future of unpaid servitude in the Vithanages's household. Resentful, she involves herself with the man meant for Thara. This choice ultimately causes her loss and suffering. Alongside Latha's story is that of Biso's, who is fleeing a drunken abusive husband, a murdered lover and townspeople who whisper whore as she walks past. Biso escapes blindly to the salvation and promise of distant relatives in the north, but her journey with her three children across the country is tainted by murder and terrorism. The kindness of strangers runs out, but the end of Biso's tragic journey will end up being the promise of Latha's future. Freeman illustrates contemporary Sri Lankan life through the battles waged between lovers, friends and strangers alike in this study in dignity, strength of character, tolerance and perseverance.(July)Copyright &copy; Reed Business Information, a division of Reed Elsevier Inc. All rights reserved.",
    "imUrl": "http://ecx.images-amazon.com/images/I/51bOckLXW8L.jpg",
    "price": "9.73",
    "brand": null
  },
  {
    "title": "Blood Games",
    "asin": "0843951818",
    "description": "In the early 1990s, as the horror market bottomed in the U.S., several established American authors, including Laymon (To Wake the Dead, etc.), were unable to find domestic publishers for their work. Laymon continued to hit bestseller lists overseas during this period, though, and this is one of the novels he wrote during that time. Like so much of his mid-career work, it's a middling effort, and it's also a mixed bag-nearly literally, as it offers a present-day scenario interspersed with flashbacks that are, in effect, standalone short stories. In the present, five young alumni of Belmore University are on their annual get-together; this year, the choice of what to do has fallen to Helen, a horror buff, who arranges for the group to camp out at a deserted backwoods lodge where guests were slaughtered by locals several years back. In time, the group encounter various townsfolk, including a witch, whom they must fight for their lives, resulting in a characteristic Laymon bloodbath. The action here is fast but predictable. Of greater interest are the flashbacks, showing first how the gang got together, then detailing their various exploits-taking revenge on some frat guys by setting fire to their house, on a cruel dean by trashing her office, on a nasty homeowner on Halloween by destroying his living room; seducing a young male surfer during a foggy nighttime trip along the California coast, etc. It's in these scenes that Laymon displays some, but not much, of the surreal nightmarish sensibility that hallmarked his great later work (The Traveling Vampire Show, etc.). Overall, then, this is brisk but routine entertainment from the controversial author, who died in 2001.Copyright 2003 Reed Business Information, Inc.",
    "imUrl": "http://ecx.images-amazon.com/images/I/61Ubgh%2BTgEL.jpg",
    "price": "3.99",
    "brand": null
  },
  {
    "title": "Tongue In Chic",
    "asin": "0451220560",
    "description": "Caught breaking into her family's old estate to steal a valuable painting hidden by her grandmother, Meadow Szarvas thought if she claimed to have amnesia, Devlin Fitzwilliam, the new owner, would have to let her go. Instead, much to her surprise, Devlin insists that Meadow is his long-lost wife. At first, Meadow plays along with Devlin, especially since she has no other options if she wants to find the much-needed painting. Things really become complicated, though, once Meadow realizes that not only is someone trying to kill Devlin but also that she is starting to fall in love with her new \"husband.\" RITA Award-winning Dodd's latest sparkling romantic suspense novel is another of her superbly sexy literary confections expertly spiced with sassy wit and featuring a beguiling cast of wonderfully entertaining characters.John CharlesCopyright &#169; American Library Association. All rights reserved",
    "imUrl": "http://ecx.images-amazon.com/images/I/51QsRoGHutL.jpg",
    "price": "5.99",
    "brand": null
  },
  {
    "title": "The Happy Minimalist: Financial independence, Good health, and a better planet for us all",
    "asin": "1436348625",
    "description": "&quot;his prose is easy and unadorned. Readers may occasionally stumble over an awkward phrase, but they will never doubt the authenticity of the writer or the clarity of his message&quot;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;  --ForeWord CLARION Reviews",
    "imUrl": "http://ecx.images-amazon.com/images/I/51g%2BJsiWwfL.jpg",
    "price": "7.0",
    "brand": null
  },
  {
    "title": "Julia's Chocolates",
    "asin": "0758214626",
    "description": "The quirky debut romance from Lamb opens as Julia Bennett flees the Boston altar where her blueblood abuser fianc&eacute;, Robert Stanfield III, awaits her. She leaves her wedding gown in a North Dakota tree, and arrives in the tiny town of Golden, Oregon to take refuge with her beloved Aunt Lydia. As Julia slowly returns to a semblance of normalcy, Lydia's eccentric friends soon become Julia's near and dear as well: minister's wife Lara, psychic Caroline and abused wife Katie all have their own hidden pains, to which Julia can relate. Robert, who hit her and made her feel bad about her body, is never far from her thoughts, nor is her incapacitating \"Dread Disease\"-a feeling of panic she can't name. The dialogue is funny and bawdy: \"Don't cry, love! You escaped a life's prison sentence with King Prick.\" Julia's struggles with people's interest in her chocolate-making, and in her person, make her a winningly flawed heroine, and there is well-deserved come-uppance for abusers of all types.Copyright &copy; Reed Business Information, a division of Reed Elsevier Inc. All rights reserved.",
    "imUrl": "http://ecx.images-amazon.com/images/I/51jZlXQL4RL.jpg",
    "price": "8.09",
    "brand": null
  },
  {
    "title": "Confessions of a Video Vixen",
    "asin": "006089248X",
    "description": "&#8220;An easy, entertaining read... a cautionary tale that contains a timeless message to a new generation of women.&#8221; (--South Florida Sun Sentinel)",
    "imUrl": "http://ecx.images-amazon.com/images/I/51D5NdwmKfL.jpg",
    "price": "7.99",
    "brand": null
  },
  {
    "title": "Deeper Than the Night",
    "asin": "050552113X",
    "description": "&ldquo;DEEPER THAN THE NIGHT is an excellent vampire romance due to the successful mixing of research science, medicine, the supernatural, and Ayn Rand-like moral questions into an exciting story line. On top of Amanda Ashley&rsquo;s terrific plot and great characterizations, curiosity will compel readers to desire a sequel starring the lead protagonists children.&rdquo;&mdash;Harriet Klausner in an America Online Review--This text refers to theAudio CDedition.",
    "imUrl": "http://ecx.images-amazon.com/images/I/51YDvYyn-gL.jpg",
    "price": "2.99",
    "brand": null
  }, 
  {
    "title": "A Walk in the Woods: Rediscovering America on the Appalachian Trail",
    "asin": "0307279464",
    "description": "Your initial reaction to Bill Bryson's reading ofA Walk in the Woodsmay well be &quot;Egads! What a bore!&quot; But by sentence three or four, his clearly articulated, slightly adenoidal, British/American-accented speech pattern begins to grow on you and becomes quite engaging. You immediately get a hint of the humor that lies ahead, such as one of the innumerable reasons he longed to walk as many of the 2,100 miles of the Appalachian Trail as he could. &quot;It would get me fit after years of waddlesome sloth&quot; is delivered with glorious deadpan flair. By the time our storyteller recounts his trip to the Dartmouth Co-op, suffering serious sticker shock over equipment prices, you'll be hooked.When Bryson speaks for the many Americans he encounters along the way--in various shops, restaurants, airports, and along the trail--he launches into his American accent, which is whiny and full of hardr's. And his southern intonations are a hoot. He's even got a special voice used exclusively when speaking for his somewhat surprising trail partner, Katz. In the 25 years since their school days together, Katz has put on quite a bit of weight. In fact, &quot;he brought to mind Orson Welles after a very bad night. He was limping a little and breathing harder than one ought to after a walk of 20 yards.&quot; Katz often speaks in monosyllables, and Bryson brings his limited vocabulary humorously to life. One of Katz's more memorable utterings is &quot;flung,&quot; as in flung most of his provisions over the cliff because they were too heavy to carry any farther.The author has thoroughly researched the history and the making of the Appalachian Trail. Bryson describes the destruction of many parts of the forest and warns of the continuing perils (both natural and man-made) the Trail faces. He speaks of the natural beauty and splendor as he and Katz pass through, and he recalls clearly the serious dangers the two face during their time together on the trail. So,A Walk in the Woodsis not simply an out-of-shape, middle-aged man's desire to prove that he can still accomplish a major physical task; it's also a plea for the conservation of America's last wilderness. Bryson's telling is a knee-slapping, laugh-out-loud funny trek through the woods, with a touch of science and history thrown in for good measure. (Running time: 360 minutes, four cassettes)--Colleen Preston--This text refers to an out of print or unavailable edition of this title.",
    "imUrl": "http://ecx.images-amazon.com/images/I/51FH8CFR32L.jpg",
    "price": "4.59",
    "brand": null
  }
]